src/InformationRegisters/РезультатыВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РезультатыВыполненияЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись о результате выполнения задачи.
//
// Параметры:
//  Задача		 - Справочник.Задачи - Ссылка на задачу;
//  Результат	 - Число - Идентификатор результата выполнения задачи;
//  Комментарий	 - Строка - Комментарий выполнения задачи (резолюция, виза).
//
Процедура ДобавитьЗаписьОВыполнении(Задача, Результат, Комментарий) Экспорт

	МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияЗадач.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Объект         = Задача;
	МенеджерЗаписи.ДатаВыполнения = ТекущаяДата();
	МенеджерЗаписи.Комментарий    = Комментарий;
	МенеджерЗаписи.Результат      = Результат;

	МенеджерЗаписи.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
